Revit 2024 API
StructuralSectionsServiceData Properties
The StructuralSectionsServiceData type exposes the following members.
Properties
Name | Description
Document
 The current document.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
StructuralSectionsServiceData Class
Autodesk.Revit.DB.Structure Namespace